// Практика JS 11.
// В этом упражнении должны написать программу, которая будет принимать в качестве параметров два массива целых чисел. Необходимо найти произведение каждого массива, после чего найти разность двух массивов, вне зависимости, какой из них больше. Если напишите решение в одну строчку, будете молодцы.

//  Пример кода:
//    example([3, 2, 5], [1, 4, 4]) => 14
//    example([9, 7, 2], [5, 2, 2]) => 106
//    example([11, 2, 5], [1, 10, 8]) => 30
//    example([4, 4, 7], [3, 9, 3]) => 31
//    example([15, 20, 25], [10, 30, 25]) => 0

function differentOfArray(a,b){
  return (a.reduce((x,y) => x * y) - b.reduce((x,y) => x * y))
  }
  
  console.log(differentOfArray([3, 2, 5], [1, 4, 4]));
  console.log(differentOfArray([9, 7, 2], [5, 2, 2]));
  console.log(differentOfArray([11, 2, 5], [1, 10, 8]));
  console.log(differentOfArray([4, 4, 7], [3, 9, 3]));
  console.log(differentOfArray([15, 20, 25], [10, 30, 25]));

